#ES分页功能  

###1、from、size方式实现分页  
当使用from、size查询：from = 990，size = 10  
（1）会从每个分片上都获取1000个文档，然后通过协调节点聚合所有的结果，最后再排序选取前1000个文档。  
（2）页数越深，占用的内存就越多。为了避免深度分页带来的内存开销。ES使用index.max_result_window参数限定了各个分片返回的文档总数为10000，此参数可以调整。  
####缺点：
页数太深会有性能问题，甚至无法进行查询

###2、Search After避免深度分页的问题  
search after搜索方式能够避免深度分页的性能问题，实时获取下一页的文档信息。  
（1）首先搜索时需要指定sort，并且保证值是唯一的，可以通过加入_id保证唯一性。  
（2）然后使用上一页最后一个文档的sort值进行查询。  

####缺点：
不支持跨页查询，只能滚动往下翻。  

###3、Scroll API  
（1）查询时创建一个快照，当有新的数据写入后，无法被查询到  
（2）每次查询后，需要输入上一次查询的Scroll Id

####缺点:  
快照创建后新插入数据无法查询，无法进行跨页  

##4、不同的搜索类型和使用场景  
（1）Regular  需要实时获取顶部的部分文档，例如查询最新订单  
（2）Scroll  需要全部的文档，例如导出数据  
（3）Pagination  简单分页使用from和size，如果深度分页，选用Search After    

